Revit 2027 API
ElementIntersectsSolidFilter.GetSolid Method
 Gets the target solid geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Solid GetSolid()
Public Function GetSolid As Solid
public:
Solid^ GetSolid()
member GetSolid : unit -> Solid
Return Value
Solid
 The solid geometry.
See Also
Reference
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace